
__author__ = 'Likhobaba R.S.'

# Задача-1: Дано произвольное целое число, вывести самую большую цифру этого числа.
# Например, дается x = 58375.
# Нужно вывести максимальную цифру в данном числе, т.е. 8.
# Подразумевается, что мы не знаем это число заранее.
# Число приходит в виде целого беззнакового.
# Подсказки:
# * постарайтесь решить задачу с применением арифметики и цикла while;
# * при желании и понимании решите задачу с применением цикла for.

value = int(input("Введите число: "))
max = 0
while (value > 0):	
	numeric = value % 10
	if(numeric > max):
		max = numeric
	value //= 10
print(max)
input()

# Задача-2: Исходные значения двух переменных запросить у пользователя.
# Поменять значения переменных местами. Вывести новые значения на экран.
# Решите задачу, используя только две переменные.
# Подсказки:
# * постарайтесь сделать решение через действия над числами;
# * при желании и понимании воспользуйтесь синтаксисом кортежей Python.

ab = (int(input("Введите 'a': ")), int(input("Введите 'b': ")))
a, b = ab
a = a + b
b = a - b
a = a - b
print((a, b))
input()

# Задача-3: Напишите программу, вычисляющую корни квадратного уравнения вида
# ax² + bx + c = 0.
# Коэффициенты уравнения вводятся пользователем.
# Для вычисления квадратного корня воспользуйтесь функцией sqrt() модуля math:
# import math
# math.sqrt(4) - вычисляет корень числа 4

import math
a = float(input("a: "))
b = float(input("b: "))
c = float(input("c: "))
d = b**2 - 4 * a * c
if(d < 0):
	print("Уравненеи не имеет корней!")
else:
	x1 = -b + math.sqrt(d)
	x2 = -b - math.sqrt(d)
	print("x1=", x1)
	print("x2=", x2)
input()


